#+TITLE: Random Variables in Theano
#+AUTHOR: Brandon T. Willard
#+DATE: 2018-12-28
#+EMAIL: brandonwillard@gmail.com
#+FILETAGS: :pymc3:theano:statistics:symbolic computation:python:probability theory:

#+STARTUP: hideblocks indent hidestars
#+OPTIONS: author:t date:t ^:nil toc:nil title:t tex:t d:(not "todo" "logbook" "note" "testing" "notes") html-preamble:t
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../extra/custom.css" />
#+STYLE: <link rel="stylesheet" type="text/css" href="../extra/custom.css" />

#+INCLUDE: org-setup.org
#+BEGIN_SRC elisp :eval t :exports none :results none
(org-babel-lob-ingest "org-babel-extensions.org")
#+END_SRC

#+PROPERTY: header-args :eval never-export :exports both :results output drawer replace
#+PROPERTY: header-args+ :session symbolic-math-pymc3-2

#+BEGIN_abstract
Continuing from [[citet:WillardSymbolicMathPyMC32018]], we'll attempt to improve
upon src_python[]{RandomFunction} and make a case for a similar src_python[]{Op} in
PyMC3.
#+END_abstract

** Random Variable Pretty Printing

In Listing [[rv-pprinter-imp]], we implement a pretty printer that produces more readable
forms of Theano graphs containing src_python{RandomVariable} nodes.

#+NAME: rv-pprinter-imp
#+BEGIN_SRC python :exports code :results none :noweb-ref new-op-code
class RandomVariablePrinter:
    """Pretty print random variables

    NOTE: When parsing LaTeX output (i.e. `self.latex=True`) in `self.process`,
    the `pstate` object is checked for a boolean `latex` and `latex_aligned`.
    The former enables LaTeX formatted output, and the latter, when `True`,
    adds a "&" before the "\sim" in the LaTeX output.
    """
    def __init__(self, name=None, latex=False):
        """
        Parameters
        ==========
        name: str (optional)
            A fixed name to use for the random variables printed by this
            printer.  If not specified, use `RandomVariable.name`.
        latex: boolean (optional)
            Whether or not to print LaTeX strings.
        """
        self.name = name
        self.latex = latex

    def process(self, output, pstate):
        if output in pstate.memo:
            return pstate.memo[output]

        pprinter = pstate.pprinter
        node = output.owner

        if node is None or not isinstance(node.op, RandomVariable):
            raise TypeError("function %s cannot represent a variable that is "
                            "not the result of a RandomVariable operation" % self.name)

        new_precedence = -1000
        out_name = output.name
        if not out_name:
            if hasattr(pstate, 'tag_generator'):
                out_name = pstate.tag_generator.get_tag()
            else:
                out_name = output.auto_name

        try:
            old_precedence = getattr(pstate, 'precedence', None)
            pstate.precedence = new_precedence

            op_name = self.name or node.op.name

            if self.latex or getattr(pstate, 'latex', False):
                sep = '&' if getattr(pstate, 'latex_aligned', False) else ''
                dist_format = "{} %s\\sim \\text{{{}}}\\left({}\\right)" % sep
            else:
                dist_format = "{} ~ {}({})"

            r = dist_format.format(
                out_name, op_name,
                ", ".join([pprinter.process(input, pstate)
                           # Skip the rng type and size parameters.
                           for input in node.inputs[2:]]))
        finally:
            pstate.precedence = old_precedence

        pstate.preamble_lines += [r]
        pstate.memo[output] = out_name

        return out_name
#+END_SRC

#+NAME: variable-tag-printer-class
#+BEGIN_SRC python :exports code :results none :noweb-ref new-op-code
from sympy import Array as SympyArray
from sympy.printing import latex as sympy_latex


class VariableTagPrinter:
    """Use readable character names for unamed variables (that aren't constant values).

    TODO: Avoid naming collisions.
    """
    @staticmethod
    def process(output, pstate):
        if output in pstate.memo:
            return pstate.memo[output]

        if isinstance(output, tt.gof.Constant):
            if output.ndim > 0 and getattr(pstate, 'latex', False):
                out_name = sympy_latex(SympyArray(output.data))
            else:
                out_name = str(output.data)
        elif output.name:
            out_name = output.name
        elif isinstance(output, tt.TensorVariable):
            out_name = "{}_u".format(pstate.tag_generator.get_tag())
        else:
            out_name = theano.printing.default_printer.process(output, pstate)

        pstate.memo[output] = out_name

        return out_name
#+END_SRC

#+NAME: preamble-pprinter-class
#+BEGIN_SRC python :exports code :results none :noweb-ref new-op-code
class PreamblePPrinter(theano.printing.PPrinter):
    """Pretty printer that displays a preamble.

    For example,

        X ~ N(\mu, \sigma)
        (b * X)

    XXX: Not thread-safe!
    """
    def __init__(self, *args, pstate_defaults=None, **kwargs):
        super().__init__(*args, **kwargs)
        self.pstate_defaults = pstate_defaults or {}
        self.printers_dict = dict(tt.pprint.printers_dict)
        self.printers = copy(tt.pprint.printers)
        self._pstate = None

    def create_state(self, pstate):
        # FIXME: Find all the user-defined node names and make the tag
        # generator aware of them.
        if pstate is None:
            pstate = theano.printing.PrinterState(pprinter=self,
                                                  preamble_lines=[],
                                                  tag_generator=theano.printing._TagGenerator(),
                                                  ,**self.pstate_defaults)
        elif isinstance(pstate, dict):
            pstate.setdefault('preamble_lines', [])
            pstate.setdefault('tag_generator', theano.printing._TagGenerator())
            pstate.update(self.pstate_defaults)
            pstate = theano.printing.PrinterState(pprinter=self, **pstate)

        # FIXME: Good old fashioned circular references...
        # We're doing this so that `self.process` will be called correctly
        # accross all code.  (I'm lookin' about you, `DimShufflePrinter`; get
        # your act together.)
        pstate.pprinter._pstate = pstate

        return pstate

    def process(self, r, pstate=None):
        pstate = self._pstate
        assert pstate
        return super().process(r, pstate)

    def __call__(self, *args):
        if len(args) == 2 and isinstance(args[1], (theano.printing.PrinterState, dict)):
            pstate = self.create_state(args[1])
            args = (args[0], pstate)
        elif len(args) == 1:
            pstate = self.create_state(None)
            args += (pstate,)
        else:
            # XXX: The graph processing doesn't pass around the printer state!
            # TODO: We'll have to copy the code and fix it...
            raise NotImplemented('No preambles for graph printing, yet.')

        body_str = super().__call__(*args)
        if pstate.preamble_lines and getattr(pstate, 'latex', False):
            preamble_str = "\n\\\\\n".join(pstate.preamble_lines)
            if getattr(pstate, 'latex_aligned', False):
                preamble_str = "\\begin{{aligned}}\n{}\n\\end{{aligned}}".format(preamble_str)
            return "\n\\\\\n".join([preamble_str, body_str])
        else:
            return "\n".join(pstate.preamble_lines + [body_str])
#+END_SRC

#+NAME: instantiate-pprinter-classes
#+BEGIN_SRC python :exports code :results none :noweb-ref new-op-code
tt_pprint = PreamblePPrinter()
tt_pprint.assign(lambda pstate, r: True, VariableTagPrinter)
tt_pprint.assign(UniformRV, RandomVariablePrinter('U'))
tt_pprint.assign(NormalRV, RandomVariablePrinter('N'))
tt_pprint.assign(GammaRV, RandomVariablePrinter('Gamma'))
tt_pprint.assign(ExponentialRV, RandomVariablePrinter('Exp'))
tt_pprint.assign(MvNormalRV, RandomVariablePrinter('N'))
tt_pprint.assign(DirichletRV, RandomVariablePrinter('Dir'))
tt_pprint.assign(PoissonRV, RandomVariablePrinter('Pois'))
tt_pprint.assign(CauchyRV, RandomVariablePrinter('C'))
tt_pprint.assign(MultinomialRV, RandomVariablePrinter('MN'))

tt_tex_pprint = PreamblePPrinter(pstate_defaults={'latex': True, 'latex_aligned': True})
tt_tex_pprint.printers = copy(tt_pprint.printers)
tt_tex_pprint.printers_dict = dict(tt_pprint.printers_dict)
tt_tex_pprint.assign(tt.mul, theano.printing.OperatorPrinter('\\circ', -1, 'either'))
tt_tex_pprint.assign(tt.true_div, theano.printing.PatternPrinter(('\\frac{%(0)s}{%(1)s}', -1000)))
tt_tex_pprint.assign(tt.pow, theano.printing.PatternPrinter(('{%(0)s}^{%(1)s}', -1000)))
#+END_SRC

#+NAME: rv-pprinter-tests
#+BEGIN_SRC python :eval never-export :exports none :results silent
tt_normalrv_name_expr = tt.scalar('b') * NormalRV(tt.scalar('\mu'), tt.scalar('\sigma'), name='X')
tt_normalrv_noname_expr = tt.scalar('b') * NormalRV(tt.scalar('\mu'), tt.scalar('\sigma'))
tt_2_normalrv_noname_expr = NormalRV(tt.scalar('\mu_2'), tt.scalar('\sigma_2')) * (tt.scalar('b') * NormalRV(tt.scalar('\mu'), tt.scalar('\sigma')) + tt.scalar('c'))

assert tt_pprint(tt_normalrv_name_expr) == "X ~ N(\mu, \sigma)\n(b * X)"
assert tt_pprint(tt_normalrv_noname_expr) == "A ~ N(\mu, \sigma)\n(b * A)"
assert tt_pprint(tt_2_normalrv_noname_expr) == "A ~ N(\mu_2, \sigma_2)\nB ~ N(\mu, \sigma)\n(A * ((b * B) + c))"
#+END_SRC

:EXAMPLE:
Listing [[rv-pprinter-exa]], creates a graph with two random variables and prints the
results with the default Theano pretty printer.
#+NAME: rv-theano-pprinter-exa
#+BEGIN_SRC python :eval never-export :results output :wrap "SRC text :eval never"
Z_tt = UniformRV(tt.scalar('l_0'), tt.scalar('l_1'), name='Z')
X_tt = NormalRV(Z_tt, tt.scalar('\sigma_1'), name='X')
Y_tt = MvNormalRV(tt.vector('\mu'), tt.abs_(X_tt) * tt.constant(np.diag([1, 2])), name='Y')

W_tt = X_tt * (tt.scalar('b') * Y_tt + tt.scalar('c'))

print(tt.pprint(W_tt))
#+END_SRC

#+RESULTS: rv-theano-pprinter-exa
#+begin_SRC text :eval never
(normal_rv(<RandomStateType>, TensorConstant{[]}, uniform_rv(<RandomStateType>, TensorConstant{[]}, l_0, l_1), \sigma_1) * ((b * multivariate_normal_rv(<RandomStateType>, TensorConstant{[]}, \mu, (|normal_rv(<RandomStateType>, TensorConstant{[]}, uniform_rv(<RandomStateType>, TensorConstant{[]}, l_0, l_1), \sigma_1)| * TensorConstant{[[1 0]
 [0 2]]}))) + c))


#+end_SRC


#+NAME: rv-pprinter-exa
#+BEGIN_SRC python :eval never-export :results output scalar raw replace
print("\\begin{{equation*}}\n{}\n\\end{{equation*}}".format(
    tt_tex_pprint(W_tt, {'latex': True, 'latex_aligned': True})))
#+END_SRC

#+RESULTS: rv-pprinter-exa
\begin{equation*}
\begin{aligned}
Z &\sim \text{U}\left(l_0, l_1\right)
\\
X &\sim \text{N}\left(Z, \sigma_1\right)
\\
Y &\sim \text{N}\left(\mu, (|X| \circ \left[\begin{matrix}1 & 0\\0 & 2\end{matrix}\right])\right)
\end{aligned}
\\
(X \circ ((b \circ Y) + c))
\end{equation*}


:END:

